# #дз
# - Повторить пройденный материал
# - Дорешать третью задачу
# - В прорешанных задачах сделать одно условие, вместо нескольких.
# * Например в задаче №1 доступность и интервал можно объединить в одно условие, что повысит читаемость кода.
# (!) Делай слияние условий там, где это целессообразно, т.к. читаемость и поодерживаемость кода важнее, чем слепить все условия в одну кучу. 
# - Изучить базовую работу с функциями
# - Изучить какие виды тестирования бывают
# - Попробовть написать тесты для трёх задач, что были в ДЗ
# - Подготовить вопросы